yield х  #Протокол send функции генератора

lambda аргументы: выражение  #Создание анонимной функции

х if у else z #Тернарный выбор (х оценивается, только если у истинно)

х or у #Логическое “ИЛИ” (у оценивается, только если х ложно)

х and у #Логическое “И” (у оценивается, только если х истинно)

not X #Логическое “НЕ”

х in у, x not in у #Членство (итерируемые объекты, множества)

x is у, x is not у #Проверки идентичности объектов

x < у, x <= у, x > у, x >= у #Сравнение по абсолютной величине, проверка на подмножество и надмножество

х == у, х != у #Операции равенства значений

х ! У #Побитовое “ИЛИ”, объединение множеств

X А у #Побитовое “исключающее ИЛИ”, симметричная разность множеств

X & у #Побитовое “И”, пересечение множеств

X « у, X » у #Сдвиг х влево или вправо на у битов

X + у #Сложение, конкатенация

X - у #Вычитание, разность множеств

X * у #Умножение, повторение

X % у #Остаток, формат

X / у, X // у #Деление: настоящее и с округлением в меньшую сторону

-х, +х #Противоположность, идентичность

~х #Побитовое “НЕ” (инверсия)

X ** у #Возведение в степень

х [1] #Индексация (последовательности, отображения и т.д.)

X [1: j : к] #Нарезание

х(...) #Вызов (функции, метода, класса и прочих вызываемых объектов)

х.атрибут #Ссылка на атрибут

(. ..) #Кортеж, выражение, выражение генератора

[...] #Список, списковое включение

{...}#Словарь, множество, включения множеств и словарей
